alifarzanehrad/stm32-audio-dsp-player/Core/Src/main.c
    AudioReverb_Reset();
}

static float32_t AudioReverb_ProcessComb(
    ReverbDelayLine *line,
    float32_t input
)
{
    float32_t delayed = line->buffer[line->index];

    /* f[n] = (1-D)d[n] + D f[n-1] */
    line->dampingState =
        (1.0f - REVERB_DAMPING) * delayed +
        REVERB_DAMPING * line->dampingState;

    /* b[n] = x[n] + G f[n] */
    line->buffer[line->index] =
        input + REVERB_FEEDBACK * line->dampingState;

    line->index++;

    if (line->index >= line->length)
    {
        line->index = 0U;
    }

    return delayed;
}

static float32_t AudioReverb_ProcessAllpass(
    ReverbDelayLine *line,
    float32_t input
)
{
    float32_t delayed = line->buffer[line->index];

    /* y[n] = -G x[n] + d[n] */
    float32_t output =
        -REVERB_ALLPASS_GAIN * input + delayed;

    /* b[n] = x[n] + G y[n] */
    line->buffer[line->index] =
        input + REVERB_ALLPASS_GAIN * output;

    line->index++;

    if (line->index >= line->length)
    {
        line->index = 0U;
    }

    return output;
}

static void AudioReverb_Process(void)
{
    for (uint32_t i = 0U; i < EQ_BLOCK_SIZE; i++)
    {
        float32_t dry[REVERB_CHANNEL_COUNT] =
        {
            eqLeftBuffer[i],
            eqRightBuffer[i]
        };
        float32_t wet[REVERB_CHANNEL_COUNT] = {0.0f, 0.0f};

        for (uint32_t channel = 0U;
             channel < REVERB_CHANNEL_COUNT;
             channel++)
        {
            for (uint32_t stage = 0U;
                 stage < REVERB_COMB_COUNT;
                 stage++)
            {
                wet[channel] += AudioReverb_ProcessComb(
                    &reverbComb[channel][stage],
                    dry[channel]
                );
            }

            wet[channel] /= (float32_t)REVERB_COMB_COUNT;

            for (uint32_t stage = 0U;
                 stage < REVERB_ALLPASS_COUNT;
                 stage++)
            {
                wet[channel] = AudioReverb_ProcessAllpass(
                    &reverbAllpass[channel][stage],
                    wet[channel]
                );
            }
        }

        /* output[n] = dry[n] + M wet[n] */
        eqLeftBuffer[i] =
            dry[0] + REVERB_MIX * wet[0];
        eqRightBuffer[i] =
            dry[1] + REVERB_MIX * wet[1];
    }
}

void AudioNoiseReduction_SetEnabled(uint8_t enabled)
{
    uint8_t newState = enabled ? 1U : 0U;

    if (NoiseReductionEnabled != newState)
    {
        NoiseReductionEnabled = newState;
        noiseReductionResetPending = 1U;
    }
}

uint8_t AudioNoiseReduction_IsEnabled(void)
{
    return NoiseReductionEnabled;
}

static void AudioNoiseReduction_Reset(void)
{
    memset(&nrLeft, 0, sizeof(nrLeft));
    memset(&nrRight, 0, sizeof(nrRight));

    for (uint32_t k = 0U; k < NR_BIN_COUNT; k++)
    {
        nrLeft.previousGain[k] = 1.0f;
        nrRight.previousGain[k] = 1.0f;
    }
}

static void AudioNoiseReduction_Init(void)
{
    if (arm_rfft_fast_init_f32(
            &nrFftInstance,
            NR_FRAME_SIZE
        ) != ARM_MATH_SUCCESS)
    {
        Error_Handler();
    }

    for (uint32_t i = 0U; i < NR_FRAME_SIZE; i++)
    {
        /* Square-root Hann gives perfect 50% overlap reconstruction. */
        float32_t hann =
            0.5f -
            0.5f * cosf((2.0f * PI * i) / NR_FRAME_SIZE);
        nrWindow[i] = sqrtf(hann);
    }

    AudioNoiseReduction_Reset();
}

static void AudioNoiseReduction_ProcessChannel(
    NoiseReductionChannel *channel,
    float32_t *samples
)
{
    for (uint32_t offset = 0U;
         offset < EQ_BLOCK_SIZE;
         offset += NR_HOP_SIZE)
    {
        memmove(
            channel->inputFrame,
            &channel->inputFrame[NR_HOP_SIZE],
            NR_HOP_SIZE * sizeof(float32_t)
        );

        memcpy(
            &channel->inputFrame[NR_HOP_SIZE],
            &samples[offset],
            NR_HOP_SIZE * sizeof(float32_t)
        );

        for (uint32_t i = 0U; i < NR_FRAME_SIZE; i++)
        {
            nrFftInput[i] =
                channel->inputFrame[i] * nrWindow[i];
        }

        arm_rfft_fast_f32(
            &nrFftInstance,
            nrFftInput,
            nrFftOutput,
            0
        );

        /*
         * P[k] = Re(X[k])^2 + Im(X[k])^2
         * N[k] = beta*N[k] + (1-beta)*P[k]
         * G[k] = max(Gmin, 1 - alpha*N[k]/(P[k] + epsilon))
         * Y[k] = G[k] * X[k]
         */
        for (uint32_t k = 0U; k < NR_BIN_COUNT; k++)
        {
            float32_t real;
            float32_t imag = 0.0f;

            if (k == 0U)
            {
                real = nrFftOutput[0];
            }
            else if (k == NR_FRAME_SIZE / 2U)
            {
                real = nrFftOutput[1];
            }
            else
            {
                real = nrFftOutput[2U * k];
                imag = nrFftOutput[2U * k + 1U];
            }

            float32_t power = real * real + imag * imag;

            if (channel->initFrameCount < NR_INIT_FRAMES)
            {
                channel->noisePower[k] +=
                    power / (float32_t)NR_INIT_FRAMES;
                nrCurrentGain[k] = 1.0f;
            }
            else
            {
                float32_t noise = channel->noisePower[k];

                if (power < NR_NOISE_UPDATE_RATIO * noise)
                {
                    noise =
                        NR_NOISE_SMOOTHING * noise +
                        (1.0f - NR_NOISE_SMOOTHING) * power;
                    channel->noisePower[k] = noise;
                }

                float32_t gain =
                    1.0f -
                    NR_OVERSUBTRACTION * noise /
                    (power + NR_EPSILON);

                if (gain < NR_MIN_GAIN)
                {
                    gain = NR_MIN_GAIN;
                }
                else if (gain > 1.0f)
                {
                    gain = 1.0f;
                }

                nrCurrentGain[k] = gain;
            }
        }

        if (channel->initFrameCount < NR_INIT_FRAMES)
        {
            channel->initFrameCount++;
        }
        else
        {
            for (uint32_t k = 0U; k < NR_BIN_COUNT; k++)
            {
                uint32_t previousBin = (k > 0U) ? k - 1U : k;
                uint32_t nextBin =
                    (k + 1U < NR_BIN_COUNT) ? k + 1U : k;

                float32_t frequencySmoothedGain =
                    (
                        nrCurrentGain[previousBin] +
                        2.0f * nrCurrentGain[k] +
                        nrCurrentGain[nextBin]
                    ) * 0.25f;

