alifarzanehrad/stm32-audio-dsp-player/Core/Src/main.c
                float32_t gain =
                    NR_GAIN_SMOOTHING * channel->previousGain[k] +
                    (1.0f - NR_GAIN_SMOOTHING) *
                    frequencySmoothedGain;

                channel->previousGain[k] = gain;

                if (k == 0U)
                {
                    nrFftOutput[0] *= gain;
                }
                else if (k == NR_FRAME_SIZE / 2U)
                {
                    nrFftOutput[1] *= gain;
                }
                else
                {
                    nrFftOutput[2U * k] *= gain;
                    nrFftOutput[2U * k + 1U] *= gain;
                }
            }
        }

        arm_rfft_fast_f32(
            &nrFftInstance,
            nrFftOutput,
            nrFftInput,
            1
        );

        for (uint32_t i = 0U; i < NR_FRAME_SIZE; i++)
        {
            channel->outputOverlap[i] +=
                nrFftInput[i] * nrWindow[i];
        }

        memcpy(
            &samples[offset],
            channel->outputOverlap,
            NR_HOP_SIZE * sizeof(float32_t)
        );

        memmove(
            channel->outputOverlap,
            &channel->outputOverlap[NR_HOP_SIZE],
            NR_HOP_SIZE * sizeof(float32_t)
        );

        memset(
            &channel->outputOverlap[NR_HOP_SIZE],
            0,
            NR_HOP_SIZE * sizeof(float32_t)
        );
    }
}

static void AudioNoiseReduction_Process(void)
{
    AudioNoiseReduction_ProcessChannel(
        &nrLeft,
        eqLeftBuffer
    );

    AudioNoiseReduction_ProcessChannel(
        &nrRight,
        eqRightBuffer
    );
}

void AudioEQ_Process(uint8_t *audioData)
{
    if (echoResetPending)
    {
        echoResetPending = 0U;
        AudioEcho_Reset();
    }

    if (reverbResetPending)
    {
        reverbResetPending = 0U;
        AudioReverb_Reset();
    }

    if (noiseReductionResetPending)
    {
        noiseReductionResetPending = 0U;
        AudioNoiseReduction_Reset();
    }

    if (!EQEnabled &&
        !EchoEnabled &&
        !ReverbEnabled &&
        !NoiseReductionEnabled)
    {
        return;
    }

    AudioEQ_ApplyPendingGains();

    int16_t *samples =
        (int16_t *)audioData;
    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        eqLeftBuffer[i] =
            (float32_t)samples[2 * i];

        eqRightBuffer[i] =
            (float32_t)samples[2 * i + 1];
    }

    if (NoiseReductionEnabled)
    {
        AudioNoiseReduction_Process();
    }

    if (EQEnabled)
    {
        for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
        {
            eqLeftBuffer[i] *= eqPreampGain;
            eqRightBuffer[i] *= eqPreampGain;
        }

    {
        arm_biquad_cascade_df1_f32(
            &eqLeft,
            eqLeftBuffer,
            eqLeftBuffer,
            EQ_BLOCK_SIZE
        );

        arm_biquad_cascade_df1_f32(
            &eqRight,
            eqRightBuffer,
            eqRightBuffer,
            EQ_BLOCK_SIZE
        );
    }

    if (EchoEnabled)
    {
        AudioEcho_Process();
    }

    if (ReverbEnabled)
    {
        AudioReverb_Process();
    }

    AudioEQ_ApplyLimiter();

    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        float32_t left = eqLeftBuffer[i];
        float32_t right = eqRightBuffer[i];

        if (left > 32767.0f)
            left = 32767.0f;

        if (left < -32768.0f)
            left = -32768.0f;

        if (right > 32767.0f)
            right = 32767.0f;

        if (right < -32768.0f)
            right = -32768.0f;

        samples[2 * i] =
            (int16_t)left;

        samples[2 * i + 1] =
            (int16_t)right;
    }
}

void AudioFFT_Process(uint8_t *audioData)
{
    int16_t *samples = (int16_t *)audioData;

    for (uint32_t i = 0; i < FFT_SIZE; i++)
    {
        int32_t left  = samples[2 * i];
        int32_t right = samples[2 * i + 1];

        fftInput[i] = ((float32_t)left + (float32_t)right) * 0.5f;
    }

    float32_t mean = 0.0f;

    for (uint32_t i = 0; i < FFT_SIZE; i++)
    {
        mean += fftInput[i];
    }

    mean /= FFT_SIZE;

    for (uint32_t i = 0; i < FFT_SIZE; i++)
    {
        fftInput[i] -= mean;
    }

    for (uint32_t i = 0; i < FFT_SIZE; i++)
    {
        fftInput[i] *= hannWindow[i];
    }

    arm_rfft_fast_f32(
        &fftInstance,
        fftInput,
        fftOutput,
        0
    );

    fftMagnitude[0] = fabsf(fftOutput[0])/ FFT_SIZE;

    for (uint32_t k = 1; k < FFT_SIZE / 2; k++)
    {
        float32_t real = fftOutput[2 * k];
        float32_t imag = fftOutput[2 * k + 1];

        fftMagnitude[k] =
            sqrtf(real * real + imag * imag)/ FFT_SIZE;
    }

    uint32_t maxBin = 1;
    float32_t maxMagnitude = fftMagnitude[1];

    for (uint32_t k = 2; k < FFT_SIZE / 2; k++)
    {
        if (fftMagnitude[k] > maxMagnitude)
        {
            maxMagnitude = fftMagnitude[k];
            maxBin = k;
        }
    }
    static const uint16_t bandEdges[FFT_BANDS + 1] =
    {
        1,
        2,
        3,
        4,
        6,
        9,
        13,
        19,
        28,
        41,
        60,
        88,
        129,
        189,
        277,
        405,
        511
    };

    for (uint32_t band = 0; band < FFT_BANDS; band++)
    {
        float32_t sum = 0.0f;

        uint32_t startBin = bandEdges[band];
        uint32_t endBin   = bandEdges[band + 1];

        for (uint32_t k = startBin; k < endBin; k++)
        {
            sum += fftMagnitude[k];
        }

        uint32_t count = endBin - startBin;

        if (count > 0)
        {
            fftBands[band] = sum / (float32_t)count;
        }
        else
        {
            fftBands[band] = 0.0f;
        }
    }
    float32_t maxBand = 1.0f;

    for (uint32_t band = 0; band < FFT_BANDS; band++)
    {
        if (fftBands[band] > maxBand)
        {
            maxBand = fftBands[band];
        }
    }

    for (uint32_t band = 0; band < FFT_BANDS; band++)
    {
        float32_t normalized =
            (fftBands[band] / maxBand) * 100.0f;

        if (normalized > 100.0f)
        {
            normalized = 100.0f;
        }

